{
  "🧪 Test message from SentryGuard API": "🧪 Message de test envoyé depuis SentryGuard.",
  "An error occurred": "❌ Une erreur s'est produite. Veuillez réessayer plus tard.",
  "Available commands": "📖 Commandes disponibles :\n\n/start - Démarrer et lier votre compte\n/status - Vérifier l'état du lien\n/help - Afficher l'aide",
  "Invalid or expired token": "❌ Token invalide ou expiré. Veuillez générer un nouveau lien depuis l'application.",
  "No account linked": "❌ Aucun compte lié. Utilisez le lien depuis l'application web.",
  "Sentry Mode activated - Check your vehicle!": "Mode Sentry activé - Vérifiez votre véhicule !",
  "TESLA SENTRY ALERT": "ALERTE SENTRY TESLA",
  "This token has expired": "⏰ Ce token a expiré. Veuillez générer un nouveau lien depuis l'application.",
  "Vehicle": "Véhicule",
  "Welcome to SentryGuard Bot": "🚗 Bienvenue sur le bot SentryGuard !\n\nPour lier votre compte, utilisez le lien fourni dans l'application web.",
  "Your account is linked and active!": "✅ Votre compte est lié et actif !",
  "Your SentryGuard account has been linked successfully!": "✅ Votre compte SentryGuard a été lié avec succès !\n\nVous recevrez désormais des alertes sur le véhicule ici.",
  "By signing or accepting this form, you consent to the processing of your Personal Data by SentryGuardOrg (\"Partner\") in the context of the Partner's application titled: SentryGuard (the \"App\").": "En signant ou en acceptant ce formulaire, vous consentez au traitement de vos Données Personnelles par SentryGuardOrg (« Partenaire ») dans le cadre de l'application du Partenaire intitulée SentryGuard (l'« App »).",
  "Partner is the data controller responsible for the processing of your Personal Data in the context of the App.": "Le Partenaire est le responsable du traitement chargé du traitement de vos Données Personnelles dans le contexte de l'App.",
  "By signing or accepting this form, you also acknowledge receipt of the Tesla Customer Privacy Notice available at": "En signant ou en acceptant ce formulaire, vous reconnaissez également avoir pris connaissance de l'Avis de confidentialité client Tesla disponible à l'adresse",
  "(\"Tesla Privacy Notice\") and consent to processing of Personal Data by Tesla in accordance with the Tesla Privacy Notice.": "(« Avis de confidentialité Tesla ») et consentez au traitement de vos Données Personnelles par Tesla conformément à l'Avis de confidentialité Tesla.",
  "The App allows you to benefit from advanced monitoring and notification features based on your Tesla vehicle's Sentry Mode, including the identification and logging of security events (e.g., event detection, Sentry Mode alerts).": "L'App vous permet de bénéficier de fonctionnalités avancées de surveillance et de notification basées sur le mode Sentinelle (Sentry Mode) de votre véhicule Tesla, notamment l'identification et la journalisation d'événements de sécurité (par exemple détection d'événements, alertes associées à Sentry Mode).",
  "To provide these features, Partner must process some of your Personal Data, which may include: profile information (account identifier, display name or email address, necessary to associate events with your account); minimal vehicle information necessary for the App to function, including vehicle identifier (VIN or equivalent), Sentry Mode status (activation, detected events) and metadata associated with Sentry Mode events (date/time, event type).": "Pour fournir ces fonctionnalités, le Partenaire doit traiter certaines de vos Données Personnelles, qui peuvent inclure :\n\n- des informations de profil (identifiant de compte, nom d'affichage ou adresse e‑mail, nécessaires pour associer les événements à votre compte) ;\n\n- des informations véhicule minimales nécessaires au fonctionnement de l'App, notamment l'identifiant du véhicule (VIN ou équivalent), l'état du mode Sentinelle (activation, événements détectés) et les métadonnées associées aux événements Sentry Mode (date/heure, type d'événement).",
  "Partner does not access or process other categories of data from your vehicle (e.g., remote commands, detailed driving data, battery or precise location information), beyond what is strictly necessary for the App to function as described above.": "Le Partenaire n'accède ni ne traite pas d'autres catégories de données issues de votre véhicule (par exemple commandes à distance, données de conduite détaillées, informations de batterie ou de localisation précise), en dehors de ce qui est strictement nécessaire au fonctionnement de l'App tel que décrit ci‑dessus.",
  "Partner will only use this information for: (a) providing you with monitoring and notification features related to Sentry Mode; (b) associating Sentry Mode events with your user account and vehicle; (c) improving service reliability and security (e.g., technical incident diagnostics); (d) complying with applicable legal obligations, where applicable.": "Le Partenaire utilisera ces informations uniquement pour :\n\n(a) vous fournir les fonctionnalités de surveillance et de notification liées au mode Sentinelle ;\n\n(b) associer les événements Sentry Mode à votre compte utilisateur et à votre véhicule ;\n\n(c) améliorer la fiabilité et la sécurité du service (par exemple diagnostic d'incidents techniques) ;\n\n(d) respecter les obligations légales applicables, le cas échéant.",
  "Partner maintains administrative, technical, and physical safeguards designed to protect Personal Data against accidental, unlawful or unauthorized destruction, loss, alteration, access, disclosure or use, including encryption of data in transit and, where appropriate, at rest. Partner will only retain your Personal Data for as long as necessary to provide you with the App and the features described above, unless otherwise required or authorized by applicable law or if you request early deletion.": "Le Partenaire maintient des mesures de protection administratives, techniques et physiques conçues pour protéger les Données Personnelles contre la destruction, la perte, l'altération, l'accès, la divulgation ou l'utilisation accidentelle, illégale ou non autorisée, y compris le chiffrement des données en transit et, lorsque cela est approprié, au repos. Le Partenaire ne conservera vos Données Personnelles que pendant la durée nécessaire pour vous fournir l'App et les fonctionnalités décrites ci‑dessus, sauf exigence ou autorisation différente de la loi applicable ou si vous demandez la suppression anticipée.",
  "Subject to applicable law (including GDPR), you may have the right to request access and receive information about your Personal Data, update and correct inaccuracies, and request deletion when legal conditions are met. You also have the right to withdraw your consent at any time, without cost, which may however limit or prevent use of the App. To exercise your rights, withdraw your consent or obtain more information about the App and the processing of your Personal Data, you can contact Partner at: abarghoud@gmail.com": "Sous réserve de la loi applicable (notamment le RGPD), vous pouvez avoir le droit de demander l'accès et de recevoir des informations sur vos Données Personnelles, de mettre à jour et corriger les inexactitudes, et de demander leur suppression lorsque les conditions légales sont remplies. Vous avez également le droit de retirer votre consentement à tout moment, sans frais, ce qui peut toutefois limiter ou empêcher l'utilisation de l'App.\n\nPour exercer vos droits, retirer votre consentement ou obtenir plus d'informations sur l'App et le traitement de vos Données Personnelles, vous pouvez contacter le Partenaire à l'adresse suivante : abarghoud@gmail.com.",
  "I consent to the collection, use, and processing of my Personal Data as described above.": "Je consens à la collecte, à l'utilisation et au traitement de mes Données Personnelles comme décrit ci‑dessus."
}
