{
  "© {{year}} SentryGuard. All rights reserved.": "© {{year}} SentryGuard. Tous droits réservés.",
  "← Back to home": "← Retour à l'accueil",
  "⏳ Waiting for you to click the link and start the bot...": "⏳ En attente que vous cliquiez sur le lien et démarriez le bot...",
  "✅ Your Telegram account is successfully linked!": "✅ Votre compte Telegram est correctement lié !",
  "About Telemetry": "À propos de la télémétrie",
  "Additional Permissions Required": "Permissions supplémentaires requises",
  "Are you sure you want to disable telemetry for this vehicle?": "Êtes-vous sûr de vouloir désactiver la télémétrie pour ce véhicule ?",
  "Are you sure you want to unlink your Telegram account?": "Êtes-vous sûr de vouloir dissocier votre compte Telegram ?",
  "Authenticating...": "Authentification en cours...",
  "Authentication Failed": "Échec de l'authentification",
  "Authentication failed {{error}}": "Échec de l'authentification : {{error}}",
  "Authentication successful! Checking consent status...": "Authentification réussie ! Vérification du statut de consentement...",
  "Authentication successful! Redirecting to consent form...": "Authentification réussie ! Redirection vers le formulaire de consentement...",
  "Authentication successful! Redirecting to dashboard...": "Authentification réussie ! Redirection vers le tableau de bord...",
  "Battery-Efficient Monitoring": "Surveillance Économe en Énergie",
  "Click \"Fix Permissions\" to re-authenticate with Tesla and grant the required permissions. You'll be redirected back here automatically.": "Cliquez sur \"Corriger les permissions\" pour vous ré-authentifier avec Tesla et accorder les permissions requises. Vous serez redirigé automatiquement ici.",
  "Click \"Generate Telegram Link\" to create a unique connection link that expires in 15 minutes.": "Cliquez sur \"Générer le lien Telegram\" pour créer un lien de connexion unique qui expire dans 15 minutes.",
  "Click the link to open our Telegram bot. The bot will automatically send a /start command with your unique token.": "Cliquez sur le lien pour ouvrir notre bot Telegram. Le bot enverra automatiquement une commande /start avec votre token unique.",
  "Configure →": "Configurer →",
  "Configuring...": "Configuration en cours...",
  "Confirm Connection": "Confirmer la connexion",
  "Connecting...": "Connexion en cours...",
  "Copied!": "Copié !",
  "Copy": "Copier",
  "Dashboard": "Tableau de bord",
  "Disable": "Désactiver",
  "Disable Telemetry": "Désactiver la télémétrie",
  "Disabled": "Désactivé",
  "Disabling...": "Désactivation en cours...",
  "Enable": "Activer",
  "Enable Telemetry": "Activer la télémétrie",
  "Enabled": "Activé",
  "Enabling telemetry allows SentryGuard to monitor your vehicle's Sentry Mode status in real-time. When suspicious activity is detected, you'll receive instant alerts via Telegram.": "L'activation de la télémétrie permet à SentryGuard de surveiller le statut du mode Sentinel de votre véhicule en temps réel sans épuiser votre batterie. Lorsqu'une activité suspecte est détectée, vous recevrez des alertes instantanées via Telegram.",
  "End-to-end encrypted communication with Tesla's official API. Your data stays yours.": "Communication chiffrée de bout en bout avec l'API officielle de Tesla. Vos données vous appartiennent.",
  "Failed to initiate login": "Échec de l'initialisation de la connexion",
  "Failed to configure telemetry": "Échec de la configuration de la télémétrie",
  "Virtual key not added to the vehicle": "Clé virtuelle non ajoutée au véhicule",
  "Unsupported hardware (pre-2018 Model S/X)": "Matériel non supporté (Model S/X avant 2018)",
  "Unsupported firmware version for telemetry": "Version logicielle non supportée pour la télémétrie",
  "Maximum telemetry configurations already present": "Nombre maximum de configurations de télémétrie atteint",
  "Vehicle skipped for an unknown reason": "Véhicule ignoré pour une raison inconnue",
  "Vehicle skipped for an unknown reason: {{details}}": "Véhicule ignoré pour une raison inconnue : {{details}}",
  "Fix Permissions": "Corriger les permissions",
  "Generate Link": "Générer le lien",
  "Generate Telegram Link": "Générer le lien Telegram",
  "Generating...": "Génération en cours...",
  "GitHub": "GitHub",
  "How It Works": "Comment ça fonctionne",
  "If donations no longer cover expenses, the service may shut down, become paid (at actual cost, around $0.50/user), or be limited to current users. Your support keeps it free and open!": "Si les dons ne couvrent plus les dépenses, le service pourra fermer, devenir payant (au coût réel, environ 0,50 $/utilisateur), ou être limité aux utilisateurs actuels. Votre soutien le garde gratuit et ouvert !",
  "Instant Alerts": "Alertes instantanées",
  "Instant Telegram notifications": "Notifications Telegram instantanées",
  "Link your Telegram account to receive instant vehicle alerts": "Lie votre compte Telegram pour recevoir des alertes instantanées sur le véhicule",
  "Link your Telegram account to receive vehicle alerts.": "Lie votre compte Telegram pour recevoir des alertes sur le véhicule.",
  "Linked": "Lié",
  "Linked on": "Lié le",
  "Loading...": "Chargement en cours...",
  "Login with Tesla": "Se connecter avec Tesla",
  "Logout": "Déconnexion",
  "Manage": "Gérer",
  "Manage Sentry Mode telemetry monitoring": "Gérer la surveillance télémétrique du mode Sentinel pour vos véhicules Tesla",
  "Manage Vehicles": "Gérer les véhicules",
  "Model": "Modèle",
  "Monitor and protect your Tesla vehicles": "Surveillez et protégez vos véhicules Tesla",
  "Monitor Sentry Mode via telemetry without battery drain": "Surveillez l'état du mode Sentinel de votre véhicule via la télémétrie, sans épuiser votre batterie.",
  "No vehicles": "Aucun véhicule",
  "No vehicles found": "Aucun véhicule trouvé",
  "No vehicles found in your Tesla account. They will appear here automatically once detected.": "Aucun véhicule trouvé dans votre compte Tesla. Ils apparaîtront ici automatiquement une fois détectés.",
  "Not affiliated with Tesla, Inc. Tesla and the Tesla logo are trademarks of Tesla, Inc.": "Non affilié à Tesla, Inc. Tesla et le logo Tesla sont des marques déposées de Tesla, Inc.",
  "Not linked": "Non lié",
  "Offline access": "Accès hors ligne",
  "Open in Telegram": "Ouvrir dans Telegram",
  "Open Telegram": "Ouvrir Telegram",
  "OpenID authentication": "Authentification OpenID",
  "Pair Virtual Key": "Associer la clé virtuelle",
  "Permission Update Required": "Mise à jour des permissions requise",
  "Privacy & Security": "Confidentialité et sécurité",
  "Processing authentication...": "Traitement de l'authentification...",
  "Protect Your Tesla": "Protégez votre Tesla",
  "Quick Actions": "Actions rapides",
  "Re-authenticating...": "Ré-authentification en cours...",
  "Real-time monitoring and instant alerts for your Tesla vehicle": "Surveillance en temps réel et alertes instantanées pour votre véhicule Tesla",
  "Real-time Sentry Mode monitoring": "Surveillance du mode Sentry en temps réel",
  "Receive Alerts": "Recevoir des alertes",
  "Receive real-time Telegram notifications when your vehicle's Sentry Mode is triggered.": "Recevez des notifications Telegram en temps réel lorsque le mode Sentry de votre véhicule est déclenché.",
  "Refresh": "Actualiser",
  "Refresh Vehicles": "Actualiser les véhicules",
  "Return to Home": "Retour à l'accueil",
  "Secure & Private": "Sécurisé et privé",
  "Secure end-to-end encryption": "Chiffrement de bout en bout sécurisé",
  "Secure OAuth authentication powered by Tesla": "Authentification OAuth sécurisée propulsée par Tesla",
  "Send Test Message": "Envoyer un message de test",
  "Sending...": "Envoi en cours...",
  "SentryGuard": "SentryGuard",
  "SentryGuard is a non-profit, open-source project built by the community for Tesla owners. It depends on donations to cover server and development costs.": "SentryGuard est un projet open-source à but non lucratif créé par la communauté pour les propriétaires de Tesla. Il dépend des dons pour couvrir les coûts de serveur et de développement.",
  "SentryGuard is a non-profit, open-source project developed by the community for Tesla owners.": "SentryGuard est un projet open-source à but non lucratif développé par la communauté pour les propriétaires de Tesla.",
  "SentryGuard needs additional permissions to work properly": "SentryGuard nécessite des permissions supplémentaires pour fonctionner correctement",
  "Setup": "Configuration",
  "Success!": "Succès !",
  "Support SentryGuard": "Soutenir SentryGuard",
  "Telegram": "Telegram",
  "Telegram Alerts": "Alertes Telegram",
  "Telegram Configuration": "Configuration Telegram",
  "Telemetry Enabled": "Télémétrie activée",
  "Tesla Authorization Revoked": "Autorisation Tesla révoquée",
  "Tesla security policies required re-authorization": "Les politiques de sécurité Tesla ont nécessité une ré-autorisation",
  "Telemetry monitors Sentry Mode and sends alerts without draining battery": "SentryGuard utilise la télémétrie pour surveiller l'état du mode Sentinel de votre véhicule et envoie des alertes Telegram instantanées lors de la détection d'activité suspecte. Une surveillance efficace qui n'épuise pas votre batterie.",
  "Telemetry Status": "Statut de la télémétrie",
  "Test message sent! Check your Telegram.": "Message de test envoyé ! Vérifiez votre Telegram.",
  "This link expires in {{minutes}} minutes": "Ce lien expire dans {{minutes}} minutes",
  "To continue using SentryGuard, please reconnect your Tesla account.": "Pour continuer à utiliser SentryGuard, veuillez reconnecter votre compte Tesla.",
  "Unlink": "Dissocier",
  "Unlinking...": "Dissociation en cours...",
  "User profile data": "Données de profil utilisateur",
  "Vehicle telemetry data": "Données de télémétrie du véhicule",
  "Vehicles": "Véhicules",
  "View all →": "Voir tout →",
  "VIN": "VIN",
  "Virtual Key Not Paired": "Clé virtuelle non associée",
  "Virtual Key Paired": "Clé virtuelle associée",
  "Welcome back": "Bon retour",
  "You need to pair your Tesla account with a virtual key to use SentryGuard.": "Vous devez associer votre compte Tesla avec une clé virtuelle pour utiliser SentryGuard.",
  "You're all set! You'll now receive instant Telegram notifications when your vehicle's Sentry Mode is triggered.": "C'est prêt ! Vous recevrez désormais des notifications Telegram instantanées lorsque le mode Sentry de votre véhicule est déclenché.",
  "Your account will be linked instantly. Return to this page to see the confirmation and send a test message.": "Votre compte sera lié instantanément. Revenez sur cette page pour voir la confirmation et envoyer un message de test.",
  "Your Telegram account is connected. You will receive alerts here.": "Votre compte Telegram est connecté. Vous recevrez des alertes ici.",
  "Your Telegram chat ID is securely stored and only used to send you vehicle alerts. You can unlink your account at any time, and all associated data will be removed.": "Votre ID de chat Telegram est stocké de manière sécurisée et utilisé uniquement pour vous envoyer des alertes sur le véhicule. Vous pouvez dissocier votre compte à tout moment, et toutes les données associées seront supprimées.",
  "Your Telegram Link": "Votre lien Telegram",
  "Your Tesla account is successfully paired with a virtual key.": "Votre compte Tesla est correctement associé à une clé virtuelle.",
  "Your Tesla account needs additional permissions to use SentryGuard": "Votre compte Tesla nécessite des permissions supplémentaires pour utiliser SentryGuard",
  "Your Tesla account access has been removed. This typically happens when:": "L'accès à votre compte Tesla a été supprimé. Cela se produit généralement lorsque :",
  "You removed SentryGuard from your Tesla account": "Vous avez supprimé SentryGuard de votre compte Tesla",
  "You changed your Tesla account password": "Vous avez changé votre mot de passe Tesla",
  "Your session has expired. Please log in again.": "Votre session a expiré. Veuillez vous reconnecter.",
  "Your Vehicles": "Vos véhicules",
  "Your vehicles will appear here once they are synced from your Tesla account. Visit the Vehicles page to refresh.": "Vos véhicules apparaîtront ici une fois synchronisés depuis votre compte Tesla. Visitez la page Véhicules pour actualiser.",
  "Something went wrong": "Une erreur s'est produite",
  "We encountered an unexpected error. Please try refreshing the page.": "Nous avons rencontré une erreur inattendue. Veuillez essayer de rafraîchir la page.",
  "Try Again": "Réessayer",
  "Reloading...": "Rechargement...",
  "If the problem persists, please contact support.": "Si le problème persiste, veuillez contacter le support.",
  "Tesla Fleet API Consent": "Consentement API Flotte Tesla",
  "Please read and accept the terms below to continue": "Veuillez lire et accepter les conditions ci-dessous pour continuer",
  "By signing or accepting this form, you consent to the processing of your Personal Data by SentryGuardOrg (\"Partner\") in the context of the Partner's application titled: SentryGuard (the \"App\").": "En signant ou en acceptant ce formulaire, vous consentez au traitement de vos Données Personnelles par SentryGuardOrg (« Partenaire ») dans le cadre de l'application du Partenaire intitulée SentryGuard (l'« App »).",
  "Partner is the data controller responsible for the processing of your Personal Data in the context of the App.": "Le Partenaire est le responsable du traitement chargé du traitement de vos Données Personnelles dans le contexte de l'App.",
  "By signing or accepting this form, you also acknowledge receipt of the Tesla Customer Privacy Notice available at": "En signant ou en acceptant ce formulaire, vous reconnaissez également avoir pris connaissance de l'Avis de confidentialité client Tesla disponible à l'adresse",
  "(\"Tesla Privacy Notice\") and consent to processing of Personal Data by Tesla in accordance with the Tesla Privacy Notice.": "(« Avis de confidentialité Tesla ») et consentez au traitement de vos Données Personnelles par Tesla conformément à l'Avis de confidentialité Tesla.",
  "The App allows you to benefit from advanced monitoring and notification features based on your Tesla vehicle's Sentry Mode, including the identification and logging of security events (e.g., event detection, Sentry Mode alerts).": "L'App vous permet de bénéficier de fonctionnalités avancées de surveillance et de notification basées sur le mode Sentinelle (Sentry Mode) de votre véhicule Tesla, notamment l'identification et la journalisation d'événements de sécurité (par exemple détection d'événements, alertes associées à Sentry Mode).",
  "To provide these features, Partner must process some of your Personal Data, which may include: profile information (account identifier, display name or email address, necessary to associate events with your account); minimal vehicle information necessary for the App to function, including vehicle identifier (VIN or equivalent), Sentry Mode status (activation, detected events) and metadata associated with Sentry Mode events (date/time, event type).": "Pour fournir ces fonctionnalités, le Partenaire doit traiter certaines de vos Données Personnelles, qui peuvent inclure :\n\n- des informations de profil (identifiant de compte, nom d'affichage ou adresse e‑mail, nécessaires pour associer les événements à votre compte) ;\n\n- des informations véhicule minimales nécessaires au fonctionnement de l'App, notamment l'identifiant du véhicule (VIN ou équivalent), l'état du mode Sentinelle (activation, événements détectés) et les métadonnées associées aux événements Sentry Mode (date/heure, type d'événement).",
  "Partner does not access or process other categories of data from your vehicle (e.g., remote commands, detailed driving data, battery or precise location information), beyond what is strictly necessary for the App to function as described above.": "Le Partenaire n'accède ni ne traite pas d'autres catégories de données issues de votre véhicule (par exemple commandes à distance, données de conduite détaillées, informations de batterie ou de localisation précise), en dehors de ce qui est strictement nécessaire au fonctionnement de l'App tel que décrit ci‑dessus.",
  "Partner will only use this information for: (a) providing you with monitoring and notification features related to Sentry Mode; (b) associating Sentry Mode events with your user account and vehicle; (c) improving service reliability and security (e.g., technical incident diagnostics); (d) complying with applicable legal obligations, where applicable.": "Le Partenaire utilisera ces informations uniquement pour :\n\n(a) vous fournir les fonctionnalités de surveillance et de notification liées au mode Sentinelle ;\n\n(b) associer les événements Sentry Mode à votre compte utilisateur et à votre véhicule ;\n\n(c) améliorer la fiabilité et la sécurité du service (par exemple diagnostic d'incidents techniques) ;\n\n(d) respecter les obligations légales applicables, le cas échéant.",
  "Partner maintains administrative, technical, and physical safeguards designed to protect Personal Data against accidental, unlawful or unauthorized destruction, loss, alteration, access, disclosure or use, including encryption of data in transit and, where appropriate, at rest. Partner will only retain your Personal Data for as long as necessary to provide you with the App and the features described above, unless otherwise required or authorized by applicable law or if you request early deletion.": "Le Partenaire maintient des mesures de protection administratives, techniques et physiques conçues pour protéger les Données Personnelles contre la destruction, la perte, l'altération, l'accès, la divulgation ou l'utilisation accidentelle, illégale ou non autorisée, y compris le chiffrement des données en transit et, lorsque cela est approprié, au repos. Le Partenaire ne conservera vos Données Personnelles que pendant la durée nécessaire pour vous fournir l'App et les fonctionnalités décrites ci‑dessus, sauf exigence ou autorisation différente de la loi applicable ou si vous demandez la suppression anticipée.",
  "Subject to applicable law (including GDPR), you may have the right to request access and receive information about your Personal Data, update and correct inaccuracies, and request deletion when legal conditions are met. You also have the right to withdraw your consent at any time, without cost, which may however limit or prevent use of the App. To exercise your rights, withdraw your consent or obtain more information about the App and the processing of your Personal Data, you can contact Partner at: abarghoud@gmail.com": "Sous réserve de la loi applicable (notamment le RGPD), vous pouvez avoir le droit de demander l'accès et de recevoir des informations sur vos Données Personnelles, de mettre à jour et corriger les inexactitudes, et de demander leur suppression lorsque les conditions légales sont remplies. Vous avez également le droit de retirer votre consentement à tout moment, sans frais, ce qui peut toutefois limiter ou empêcher l'utilisation de l'App.\n\nPour exercer vos droits, retirer votre consentement ou obtenir plus d'informations sur l'App et le traitement de vos Données Personnelles, vous pouvez contacter le Partenaire à l'adresse suivante : abarghoud@gmail.com.",
  "I consent to the collection, use, and processing of my Personal Data as described above.": "Je consens à la collecte, à l'utilisation et au traitement de mes Données Personnelles comme décrit ci‑dessus.",
  "I Accept": "J'accepte",
  "Processing...": "Traitement en cours...",
  "Consent accepted successfully!": "Consentement accepté avec succès !",
  "Accepted at: {{date}}": "Accepté le : {{date}}",
  "Redirecting to dashboard...": "Redirection vers le tableau de bord...",
  "By clicking \"I Accept\", you agree to the terms above and consent to the processing of your personal data.": "En cliquant sur \"J'accepte\", vous acceptez les conditions ci-dessus et consentez au traitement de vos données personnelles.",
  "Revoke Consent": "Révoquer le consentement",
  "Are you sure you want to revoke your consent? This will disable all Tesla Fleet API features.": "Êtes-vous sûr de vouloir révoquer votre consentement ? Cela désactivera toutes les fonctionnalités de l'API Flotte Tesla.",
  "Loading consent text...": "Chargement du texte de consentement...",
  "Failed to load consent text": "Échec du chargement du texte de consentement"
}
