{
  "© {{year}} SentryGuard. All rights reserved.": "© {{year}} SentryGuard. Tous droits réservés.",
  "← Back to home": "← Retour à l'accueil",
  "⏳ Waiting for you to click the link and start the bot...": "⏳ En attente que vous cliquiez sur le lien et démarriez le bot...",
  "✅ Your Telegram account is successfully linked!": "✅ Votre compte Telegram est correctement lié !",
  "About Telemetry": "À propos de la télémétrie",
  "Additional Permissions Required": "Permissions supplémentaires requises",
  "Are you sure you want to unlink your Telegram account?": "Êtes-vous sûr de vouloir dissocier votre compte Telegram ?",
  "Authenticating...": "Authentification en cours...",
  "Authentication Failed": "Échec de l'authentification",
  "Authentication failed {{error}}": "Échec de l'authentification : {{error}}",
  "Authentication successful! Redirecting to dashboard...": "Authentification réussie ! Redirection vers le tableau de bord...",
  "Battery-Efficient Monitoring": "Surveillance Économe en Énergie",
  "Click \"Fix Permissions\" to re-authenticate with Tesla and grant the required permissions. You'll be redirected back here automatically.": "Cliquez sur \"Corriger les permissions\" pour vous ré-authentifier avec Tesla et accorder les permissions requises. Vous serez redirigé automatiquement ici.",
  "Click \"Generate Telegram Link\" to create a unique connection link that expires in 15 minutes.": "Cliquez sur \"Générer le lien Telegram\" pour créer un lien de connexion unique qui expire dans 15 minutes.",
  "Click the link to open our Telegram bot. The bot will automatically send a /start command with your unique token.": "Cliquez sur le lien pour ouvrir notre bot Telegram. Le bot enverra automatiquement une commande /start avec votre token unique.",
  "Configure →": "Configurer →",
  "Configuring...": "Configuration en cours...",
  "Confirm Connection": "Confirmer la connexion",
  "Connecting...": "Connexion en cours...",
  "Copied!": "Copié !",
  "Copy": "Copier",
  "Dashboard": "Tableau de bord",
  "Disabled": "Désactivé",
  "Enable Telemetry": "Activer la télémétrie",
  "Enabled": "Activé",
  "Enabling telemetry allows SentryGuard to monitor your vehicle's Sentry Mode status in real-time. When suspicious activity is detected, you'll receive instant alerts via Telegram.": "L'activation de la télémétrie permet à SentryGuard de surveiller le statut du mode Sentinel de votre véhicule en temps réel sans épuiser votre batterie. Lorsqu'une activité suspecte est détectée, vous recevrez des alertes instantanées via Telegram.",
  "End-to-end encrypted communication with Tesla's official API. Your data stays yours.": "Communication chiffrée de bout en bout avec l'API officielle de Tesla. Vos données vous appartiennent.",
  "Failed to initiate login": "Échec de l'initialisation de la connexion",
  "Fix Permissions": "Corriger les permissions",
  "Generate Link": "Générer le lien",
  "Generate Telegram Link": "Générer le lien Telegram",
  "Generating...": "Génération en cours...",
  "GitHub": "GitHub",
  "How It Works": "Comment ça fonctionne",
  "If donations no longer cover expenses, the service may shut down, become paid (at actual cost, around $0.50/user), or be limited to current users. Your support keeps it free and open!": "Si les dons ne couvrent plus les dépenses, le service pourra fermer, devenir payant (au coût réel, environ 0,50 $/utilisateur), ou être limité aux utilisateurs actuels. Votre soutien le garde gratuit et ouvert !",
  "Instant Alerts": "Alertes instantanées",
  "Instant Telegram notifications": "Notifications Telegram instantanées",
  "Link your Telegram account to receive instant vehicle alerts": "Lie votre compte Telegram pour recevoir des alertes instantanées sur le véhicule",
  "Link your Telegram account to receive vehicle alerts.": "Lie votre compte Telegram pour recevoir des alertes sur le véhicule.",
  "Linked": "Lié",
  "Linked on {{date}}": "Lié le {{date}}",
  "Loading...": "Chargement en cours...",
  "Login with Tesla": "Se connecter avec Tesla",
  "Logout": "Déconnexion",
  "Manage": "Gérer",
  "Manage Sentry Mode telemetry monitoring": "Gérer la surveillance télémétrique du mode Sentinel pour vos véhicules Tesla",
  "Manage Vehicles": "Gérer les véhicules",
  "Model": "Modèle",
  "Monitor and protect your Tesla vehicles": "Surveillez et protégez vos véhicules Tesla",
  "Monitor Sentry Mode via telemetry without battery drain": "Surveillez l'état du mode Sentinel de votre véhicule via la télémétrie, sans épuiser votre batterie.",
  "No vehicles": "Aucun véhicule",
  "No vehicles found": "Aucun véhicule trouvé",
  "No vehicles found in your Tesla account. They will appear here automatically once detected.": "Aucun véhicule trouvé dans votre compte Tesla. Ils apparaîtront ici automatiquement une fois détectés.",
  "Not affiliated with Tesla, Inc. Tesla and the Tesla logo are trademarks of Tesla, Inc.": "Non affilié à Tesla, Inc. Tesla et le logo Tesla sont des marques déposées de Tesla, Inc.",
  "Not linked": "Non lié",
  "Offline access": "Accès hors ligne",
  "Open in Telegram": "Ouvrir dans Telegram",
  "Open Telegram": "Ouvrir Telegram",
  "OpenID authentication": "Authentification OpenID",
  "Pair Virtual Key": "Associer la clé virtuelle",
  "Permission Update Required": "Mise à jour des permissions requise",
  "Privacy & Security": "Confidentialité et sécurité",
  "Processing authentication...": "Traitement de l'authentification...",
  "Protect Your Tesla": "Protégez votre Tesla",
  "Quick Actions": "Actions rapides",
  "Re-authenticating...": "Ré-authentification en cours...",
  "Real-time monitoring and instant alerts for your Tesla vehicle": "Surveillance en temps réel et alertes instantanées pour votre véhicule Tesla",
  "Real-time Sentry Mode monitoring": "Surveillance du mode Sentry en temps réel",
  "Receive Alerts": "Recevoir des alertes",
  "Receive real-time Telegram notifications when your vehicle's Sentry Mode is triggered.": "Recevez des notifications Telegram en temps réel lorsque le mode Sentry de votre véhicule est déclenché.",
  "Refresh": "Actualiser",
  "Refresh Vehicles": "Actualiser les véhicules",
  "Return to Home": "Retour à l'accueil",
  "Secure & Private": "Sécurisé et privé",
  "Secure end-to-end encryption": "Chiffrement de bout en bout sécurisé",
  "Secure OAuth authentication powered by Tesla": "Authentification OAuth sécurisée propulsée par Tesla",
  "Send Test Message": "Envoyer un message de test",
  "Sending...": "Envoi en cours...",
  "SentryGuard": "SentryGuard",
  "SentryGuard depends on donations to operate. Your support keeps us running! ☕": "SentryGuard dépend des dons pour fonctionner. Votre soutien nous permet de continuer ! ☕",
  "SentryGuard is a non-profit, open-source project built by the community for Tesla owners. It depends on donations to cover server and development costs.": "SentryGuard est un projet open-source à but non lucratif créé par la communauté pour les propriétaires de Tesla. Il dépend des dons pour couvrir les coûts de serveur et de développement.",
  "SentryGuard is a non-profit, open-source project developed by the community for Tesla owners.": "SentryGuard est un projet open-source à but non lucratif développé par la communauté pour les propriétaires de Tesla.",
  "SentryGuard needs additional permissions to work properly": "SentryGuard nécessite des permissions supplémentaires pour fonctionner correctement",
  "Setup": "Configuration",
  "Success!": "Succès !",
  "Support SentryGuard": "Soutenir SentryGuard",
  "Telegram": "Telegram",
  "Telegram Alerts": "Alertes Telegram",
  "Telegram Configuration": "Configuration Telegram",
  "Telemetry Enabled": "Télémétrie activée",
  "Telemetry monitors Sentry Mode and sends alerts without draining battery": "SentryGuard utilise la télémétrie pour surveiller l'état du mode Sentinel de votre véhicule et envoie des alertes Telegram instantanées lors de la détection d'activité suspecte. Une surveillance efficace qui n'épuise pas votre batterie.",
  "Telemetry Status": "Statut de la télémétrie",
  "Test message sent! Check your Telegram.": "Message de test envoyé ! Vérifiez votre Telegram.",
  "This link expires in {{minutes}} minutes": "Ce lien expire dans {{minutes}} minutes",
  "Unlink": "Dissocier",
  "Unlinking...": "Dissociation en cours...",
  "User profile data": "Données de profil utilisateur",
  "Vehicle telemetry data": "Données de télémétrie du véhicule",
  "Vehicles": "Véhicules",
  "View all →": "Voir tout →",
  "VIN": "VIN",
  "Virtual Key Not Paired": "Clé virtuelle non associée",
  "Virtual Key Paired": "Clé virtuelle associée",
  "Welcome back": "Bon retour",
  "You need to pair your Tesla account with a virtual key to use SentryGuard.": "Vous devez associer votre compte Tesla avec une clé virtuelle pour utiliser SentryGuard.",
  "You're all set! You'll now receive instant Telegram notifications when your vehicle's Sentry Mode is triggered.": "C'est prêt ! Vous recevrez désormais des notifications Telegram instantanées lorsque le mode Sentry de votre véhicule est déclenché.",
  "Your account will be linked instantly. Return to this page to see the confirmation and send a test message.": "Votre compte sera lié instantanément. Revenez sur cette page pour voir la confirmation et envoyer un message de test.",
  "Your Telegram account is connected. You will receive alerts here.": "Votre compte Telegram est connecté. Vous recevrez des alertes ici.",
  "Your Telegram chat ID is securely stored and only used to send you vehicle alerts. You can unlink your account at any time, and all associated data will be removed.": "Votre ID de chat Telegram est stocké de manière sécurisée et utilisé uniquement pour vous envoyer des alertes sur le véhicule. Vous pouvez dissocier votre compte à tout moment, et toutes les données associées seront supprimées.",
  "Your Telegram Link": "Votre lien Telegram",
  "Your Tesla account is successfully paired with a virtual key.": "Votre compte Tesla est correctement associé à une clé virtuelle.",
  "Your Tesla account needs additional permissions to use SentryGuard": "Votre compte Tesla nécessite des permissions supplémentaires pour utiliser SentryGuard",
  "Your Vehicles": "Vos véhicules",
  "Your vehicles will appear here once they are synced from your Tesla account. Visit the Vehicles page to refresh.": "Vos véhicules apparaîtront ici une fois synchronisés depuis votre compte Tesla. Visitez la page Véhicules pour actualiser."
}
