{
  "© {{year}} SentryGuard. All rights reserved.": "© {{year}} SentryGuard. Tous droits réservés.",
  "← Back to home": "← Retour à l'accueil",
  "⏳ Waiting for you to click the link and start the bot...": "⏳ En attente que vous cliquiez sur le lien et démarriez le bot...",
  "✅ Your Telegram account is successfully linked!": "✅ Votre compte Telegram est correctement lié !",
  "About Telemetry": "À propos de la télémétrie",
  "Additional Permissions Required": "Permissions supplémentaires requises",
  "Are you sure you want to disable telemetry for this vehicle?": "Êtes-vous sûr de vouloir désactiver la télémétrie pour ce véhicule ?",
  "Are you sure you want to unlink your Telegram account?": "Êtes-vous sûr de vouloir dissocier votre compte Telegram ?",
  "Authenticating...": "Authentification en cours...",
  "Authentication Failed": "Échec de l'authentification",
  "Authentication failed {{error}}": "Échec de l'authentification : {{error}}",
  "Authentication successful! Checking consent status...": "Authentification réussie ! Vérification du statut de consentement...",
  "Authentication successful! Redirecting to consent form...": "Authentification réussie ! Redirection vers le formulaire de consentement...",
  "Authentication successful! Redirecting to dashboard...": "Authentification réussie ! Redirection vers le tableau de bord...",
  "Battery-Efficient Monitoring": "Surveillance Économe en Énergie",
  "Click \"Fix Permissions\" to re-authenticate with Tesla and grant the required permissions. You'll be redirected back here automatically.": "Cliquez sur \"Corriger les permissions\" pour vous ré-authentifier avec Tesla et accorder les permissions requises. Vous serez redirigé automatiquement ici.",
  "Click \"Generate Telegram Link\" to create a unique connection link that expires in 15 minutes.": "Cliquez sur \"Générer le lien Telegram\" pour créer un lien de connexion unique qui expire dans 15 minutes.",
  "Click the link to open our Telegram bot. The bot will automatically send a /start command with your unique token.": "Cliquez sur le lien pour ouvrir notre bot Telegram. Le bot enverra automatiquement une commande /start avec votre token unique.",
  "Configure →": "Configurer →",
  "Configuring...": "Configuration en cours...",
  "Confirm Connection": "Confirmer la connexion",
  "Connecting...": "Connexion en cours...",
  "Copied!": "Copié !",
  "Copy": "Copier",
  "Dashboard": "Tableau de bord",
  "Disable": "Désactiver",
  "Disable Telemetry": "Désactiver la télémétrie",
  "Disabled": "Désactivé",
  "Disabling...": "Désactivation en cours...",
  "Enable": "Activer",
  "Enable Telemetry": "Activer la télémétrie",
  "Enabled": "Activé",
  "Enabling telemetry allows SentryGuard to monitor your vehicle's Sentry Mode status in real-time. When suspicious activity is detected, you'll receive instant alerts via Telegram.": "L'activation de la télémétrie permet à SentryGuard de surveiller le statut du mode Sentinel de votre véhicule en temps réel sans épuiser votre batterie. Lorsqu'une activité suspecte est détectée, vous recevrez des alertes instantanées via Telegram.",
  "End-to-end encrypted communication with Tesla's official API. Your data stays yours.": "Communication chiffrée de bout en bout avec l'API officielle de Tesla. Vos données vous appartiennent.",
  "Failed to initiate login": "Échec de l'initialisation de la connexion",
  "Fix Permissions": "Corriger les permissions",
  "Generate Link": "Générer le lien",
  "Generate Telegram Link": "Générer le lien Telegram",
  "Generating...": "Génération en cours...",
  "GitHub": "GitHub",
  "How It Works": "Comment ça fonctionne",
  "If donations no longer cover expenses, the service may shut down, become paid (at actual cost, around $0.50/user), or be limited to current users. Your support keeps it free and open!": "Si les dons ne couvrent plus les dépenses, le service pourra fermer, devenir payant (au coût réel, environ 0,50 $/utilisateur), ou être limité aux utilisateurs actuels. Votre soutien le garde gratuit et ouvert !",
  "Instant Alerts": "Alertes instantanées",
  "Instant Telegram notifications": "Notifications Telegram instantanées",
  "Link your Telegram account to receive instant vehicle alerts": "Lie votre compte Telegram pour recevoir des alertes instantanées sur le véhicule",
  "Link your Telegram account to receive vehicle alerts.": "Lie votre compte Telegram pour recevoir des alertes sur le véhicule.",
  "Linked": "Lié",
  "Linked on {{date}}": "Lié le {{date}}",
  "Loading...": "Chargement en cours...",
  "Login with Tesla": "Se connecter avec Tesla",
  "Logout": "Déconnexion",
  "Manage": "Gérer",
  "Manage Sentry Mode telemetry monitoring": "Gérer la surveillance télémétrique du mode Sentinel pour vos véhicules Tesla",
  "Manage Vehicles": "Gérer les véhicules",
  "Model": "Modèle",
  "Monitor and protect your Tesla vehicles": "Surveillez et protégez vos véhicules Tesla",
  "Monitor Sentry Mode via telemetry without battery drain": "Surveillez l'état du mode Sentinel de votre véhicule via la télémétrie, sans épuiser votre batterie.",
  "No vehicles": "Aucun véhicule",
  "No vehicles found": "Aucun véhicule trouvé",
  "No vehicles found in your Tesla account. They will appear here automatically once detected.": "Aucun véhicule trouvé dans votre compte Tesla. Ils apparaîtront ici automatiquement une fois détectés.",
  "Not affiliated with Tesla, Inc. Tesla and the Tesla logo are trademarks of Tesla, Inc.": "Non affilié à Tesla, Inc. Tesla et le logo Tesla sont des marques déposées de Tesla, Inc.",
  "Not linked": "Non lié",
  "Offline access": "Accès hors ligne",
  "Open in Telegram": "Ouvrir dans Telegram",
  "Open Telegram": "Ouvrir Telegram",
  "OpenID authentication": "Authentification OpenID",
  "Pair Virtual Key": "Associer la clé virtuelle",
  "Permission Update Required": "Mise à jour des permissions requise",
  "Privacy & Security": "Confidentialité et sécurité",
  "Processing authentication...": "Traitement de l'authentification...",
  "Protect Your Tesla": "Protégez votre Tesla",
  "Quick Actions": "Actions rapides",
  "Re-authenticating...": "Ré-authentification en cours...",
  "Real-time monitoring and instant alerts for your Tesla vehicle": "Surveillance en temps réel et alertes instantanées pour votre véhicule Tesla",
  "Real-time Sentry Mode monitoring": "Surveillance du mode Sentry en temps réel",
  "Receive Alerts": "Recevoir des alertes",
  "Receive real-time Telegram notifications when your vehicle's Sentry Mode is triggered.": "Recevez des notifications Telegram en temps réel lorsque le mode Sentry de votre véhicule est déclenché.",
  "Refresh": "Actualiser",
  "Refresh Vehicles": "Actualiser les véhicules",
  "Return to Home": "Retour à l'accueil",
  "Secure & Private": "Sécurisé et privé",
  "Secure end-to-end encryption": "Chiffrement de bout en bout sécurisé",
  "Secure OAuth authentication powered by Tesla": "Authentification OAuth sécurisée propulsée par Tesla",
  "Send Test Message": "Envoyer un message de test",
  "Sending...": "Envoi en cours...",
  "SentryGuard": "SentryGuard",
  "SentryGuard is a non-profit, open-source project built by the community for Tesla owners. It depends on donations to cover server and development costs.": "SentryGuard est un projet open-source à but non lucratif créé par la communauté pour les propriétaires de Tesla. Il dépend des dons pour couvrir les coûts de serveur et de développement.",
  "SentryGuard is a non-profit, open-source project developed by the community for Tesla owners.": "SentryGuard est un projet open-source à but non lucratif développé par la communauté pour les propriétaires de Tesla.",
  "SentryGuard needs additional permissions to work properly": "SentryGuard nécessite des permissions supplémentaires pour fonctionner correctement",
  "Setup": "Configuration",
  "Success!": "Succès !",
  "Support SentryGuard": "Soutenir SentryGuard",
  "Telegram": "Telegram",
  "Telegram Alerts": "Alertes Telegram",
  "Telegram Configuration": "Configuration Telegram",
  "Telemetry Enabled": "Télémétrie activée",
  "Tesla Authorization Revoked": "Autorisation Tesla révoquée",
  "Tesla security policies required re-authorization": "Les politiques de sécurité Tesla ont nécessité une ré-autorisation",
  "Telemetry monitors Sentry Mode and sends alerts without draining battery": "SentryGuard utilise la télémétrie pour surveiller l'état du mode Sentinel de votre véhicule et envoie des alertes Telegram instantanées lors de la détection d'activité suspecte. Une surveillance efficace qui n'épuise pas votre batterie.",
  "Telemetry Status": "Statut de la télémétrie",
  "Test message sent! Check your Telegram.": "Message de test envoyé ! Vérifiez votre Telegram.",
  "This link expires in {{minutes}} minutes": "Ce lien expire dans {{minutes}} minutes",
  "To continue using SentryGuard, please reconnect your Tesla account.": "Pour continuer à utiliser SentryGuard, veuillez reconnecter votre compte Tesla.",
  "Unlink": "Dissocier",
  "Unlinking...": "Dissociation en cours...",
  "User profile data": "Données de profil utilisateur",
  "Vehicle telemetry data": "Données de télémétrie du véhicule",
  "Vehicles": "Véhicules",
  "View all →": "Voir tout →",
  "VIN": "VIN",
  "Virtual Key Not Paired": "Clé virtuelle non associée",
  "Virtual Key Paired": "Clé virtuelle associée",
  "Welcome back": "Bon retour",
  "You need to pair your Tesla account with a virtual key to use SentryGuard.": "Vous devez associer votre compte Tesla avec une clé virtuelle pour utiliser SentryGuard.",
  "You're all set! You'll now receive instant Telegram notifications when your vehicle's Sentry Mode is triggered.": "C'est prêt ! Vous recevrez désormais des notifications Telegram instantanées lorsque le mode Sentry de votre véhicule est déclenché.",
  "Your account will be linked instantly. Return to this page to see the confirmation and send a test message.": "Votre compte sera lié instantanément. Revenez sur cette page pour voir la confirmation et envoyer un message de test.",
  "Your Telegram account is connected. You will receive alerts here.": "Votre compte Telegram est connecté. Vous recevrez des alertes ici.",
  "Your Telegram chat ID is securely stored and only used to send you vehicle alerts. You can unlink your account at any time, and all associated data will be removed.": "Votre ID de chat Telegram est stocké de manière sécurisée et utilisé uniquement pour vous envoyer des alertes sur le véhicule. Vous pouvez dissocier votre compte à tout moment, et toutes les données associées seront supprimées.",
  "Your Telegram Link": "Votre lien Telegram",
  "Your Tesla account is successfully paired with a virtual key.": "Votre compte Tesla est correctement associé à une clé virtuelle.",
  "Your Tesla account needs additional permissions to use SentryGuard": "Votre compte Tesla nécessite des permissions supplémentaires pour utiliser SentryGuard",
  "Your Tesla account access has been removed. This typically happens when:": "L'accès à votre compte Tesla a été supprimé. Cela se produit généralement lorsque :",
  "You removed SentryGuard from your Tesla account": "Vous avez supprimé SentryGuard de votre compte Tesla",
  "You changed your Tesla account password": "Vous avez changé votre mot de passe Tesla",
  "Your session has expired. Please log in again.": "Votre session a expiré. Veuillez vous reconnecter.",
  "Your Vehicles": "Vos véhicules",
  "Your vehicles will appear here once they are synced from your Tesla account. Visit the Vehicles page to refresh.": "Vos véhicules apparaîtront ici une fois synchronisés depuis votre compte Tesla. Visitez la page Véhicules pour actualiser.",
  "Tesla Fleet API Consent": "Consentement API Flotte Tesla",
  "Please read and accept the terms below to continue": "Veuillez lire et accepter les conditions ci-dessous pour continuer",
  "By signing or accepting this form, you consent to the processing of your Personal Data by SentryGuardOrg (\"Partner\") in the context of the Partner's application titled: TeslaGuard (the \"App\").": "En signant ou acceptant ce formulaire, vous consentez au traitement de vos Données Personnelles par SentryGuardOrg (« Partenaire ») dans le contexte de l'application du Partenaire intitulée : TeslaGuard (l'« App »).",
  "Partner is the data controller responsible for the processing of your Personal Data in the context of the App.": "Le Partenaire est le responsable du traitement chargé du traitement de vos Données Personnelles dans le contexte de l'App.",
  "By signing or accepting this form, you also acknowledge receipt of the Tesla Customer Privacy Notice available at": "En signant ou acceptant ce formulaire, vous reconnaissez également avoir reçu l'Avis de confidentialité client Tesla disponible à l'adresse",
  "(\"Tesla Privacy Notice\") and consent to processing of Personal Data by Tesla in accordance with the Tesla Privacy Notice.": "(« Avis de confidentialité Tesla ») et consentez au traitement des Données Personnelles par Tesla conformément à l'Avis de confidentialité Tesla.",
  "The App will allow you to benefit from advanced functionalities and will allow Partner to better manage Partner Products. These functionalities may include Tesla product remote commands (e.g., locking/unlocking doors, opening trunk, enable remote start if correct password is provided, open/close roof, honking horn, flashing lights, climate controls, and charge limit), and remote collection of information about product state (such as energy data, charge state, lock state, drive state, climate state, and current location).": "L'App vous permettra de bénéficier de fonctionnalités avancées et permettra au Partenaire de mieux gérer les Produits du Partenaire. Ces fonctionnalités peuvent inclure des commandes à distance de produits Tesla (par exemple, verrouillage/déverrouillage des portes, ouverture du coffre, activation du démarrage à distance si le mot de passe correct est fourni, ouverture/fermeture du toit, klaxon, clignotants, contrôles climatiques et limite de charge), et collecte à distance d'informations sur l'état du produit (telles que les données énergétiques, l'état de charge, l'état de verrouillage, l'état de conduite, l'état climatique et l'emplacement actuel).",
  "You understand and agree that to benefit from the App advanced functionalities and Partner's fleet management, Partner must process some of your Personal Data, which may include information about Tesla products such as a device number such as a vehicle identification number, speed information, odometer, battery use management information, battery charging history, electrical system functions, software version information, safety related data (including information regarding a vehicle's SRS systems, brakes, security, e-brake), data about any issues that could materially impair operation of a Partner Product; data about any safety critical issues and safety critical events; data about software and firmware updates, vehicle and drive state data (including the road segment data and current location) and other data to assist in identifying and analyzing the performance of the Tesla product.": "Vous comprenez et acceptez que pour bénéficier des fonctionnalités avancées de l'App et de la gestion de flotte du Partenaire, le Partenaire doit traiter certaines de vos Données Personnelles, qui peuvent inclure des informations sur les produits Tesla telles qu'un numéro d'appareil tel qu'un numéro d'identification de véhicule, des informations de vitesse, un odomètre, des informations de gestion d'utilisation de batterie, un historique de charge de batterie, des fonctions de système électrique, des informations de version logicielle, des données liées à la sécurité (y compris des informations concernant les systèmes SRS d'un véhicule, freins, sécurité, frein de secours), des données sur tout problème pouvant matériellement altérer le fonctionnement d'un Produit du Partenaire ; des données sur tout problème critique de sécurité et événement critique de sécurité ; des données sur les mises à jour logicielles et matérielles, les données d'état du véhicule et de conduite (y compris les données de segment routier et l'emplacement actuel) et d'autres données pour aider à identifier et analyser les performances du produit Tesla.",
  "Partner will only use this information as described in this document and in particular to (a) provide you with the above functionalities, (b) issue remote product commands or collect information about certain aspects of a product's state, (c) advise you on important safety-related information, (d) collect information about a product's performance and provide services related to the product, (e) collect information about the use of the product (for example, in order to enable better management the product), and (f) provide services to product users (such as vehicle passengers) where applicable.": "Le Partenaire n'utilisera ces informations que comme décrit dans ce document et notamment pour (a) vous fournir les fonctionnalités susmentionnées, (b) émettre des commandes de produit à distance ou collecter des informations sur certains aspects de l'état d'un produit, (c) vous conseiller sur des informations importantes liées à la sécurité, (d) collecter des informations sur les performances d'un produit et fournir des services liés au produit, (e) collecter des informations sur l'utilisation du produit (par exemple, afin de permettre une meilleure gestion du produit), et (f) fournir des services aux utilisateurs du produit (tels que les passagers du véhicule) le cas échéant.",
  "Partner maintains administrative, technical, and physical safeguards designed to protect Personal Data against accidental, unlawful or unauthorized destruction, loss, alteration, access, disclosure or use. Partner will only retain your Personal Data for as long as necessary to provide you with the App, unless otherwise authorized by you, or required or authorized by applicable law.": "Le Partenaire maintient des mesures de protection administratives, techniques et physiques conçues pour protéger les Données Personnelles contre la destruction, la perte, l'altération, l'accès, la divulgation ou l'utilisation accidentelle, illégale ou non autorisée. Le Partenaire ne conservera vos Données Personnelles que pendant la durée nécessaire pour vous fournir l'App, sauf autorisation contraire de votre part, ou exigé ou autorisé par la loi applicable.",
  "Subject to applicable law, you may have the right to request access to and receive information about your Personal Data, update and correct inaccuracies in your Personal Data, and have the information deleted, as appropriate. These rights may be limited in some circumstances by local law requirements. You also have the right to withdraw your consent at any time without cost and to access your consent declaration at any time. To exercise your rights or for more information about the App, contact Partner as follows: abarghoud@gmail.com": "Sous réserve de la loi applicable, vous pouvez avoir le droit de demander l'accès et de recevoir des informations sur vos Données Personnelles, de mettre à jour et corriger les inexactitudes dans vos Données Personnelles, et de les faire supprimer, le cas échéant. Ces droits peuvent être limités dans certaines circonstances par les exigences de la loi locale. Vous avez également le droit de retirer votre consentement à tout moment sans frais et d'accéder à votre déclaration de consentement à tout moment. Pour exercer vos droits ou pour plus d'informations sur l'App, contactez le Partenaire comme suit : abarghoud@gmail.com",
  "I consent to the collection, use, and processing of my Personal Data as described above.": "Je consens à la collecte, à l'utilisation et au traitement de mes Données Personnelles comme décrit ci-dessus.",
  "I Accept": "J'accepte",
  "Processing...": "Traitement en cours...",
  "Consent accepted successfully!": "Consentement accepté avec succès !",
  "Accepted at: {{date}}": "Accepté le : {{date}}",
  "Redirecting to dashboard...": "Redirection vers le tableau de bord...",
  "By clicking \"I Accept\", you agree to the terms above and consent to the processing of your personal data.": "En cliquant sur \"J'accepte\", vous acceptez les conditions ci-dessus et consentez au traitement de vos données personnelles.",
  "Revoke Consent": "Révoquer le consentement",
  "Are you sure you want to revoke your consent? This will disable all Tesla Fleet API features.": "Êtes-vous sûr de vouloir révoquer votre consentement ? Cela désactivera toutes les fonctionnalités de l'API Flotte Tesla."
}
