{
  "© {{year}} SentryGuard. All rights reserved.": "© {{year}} SentryGuard. Tous droits réservés.",
  "← Back to home": "← Retour à l'accueil",
  "⏳ Waiting for you to click the link and start the bot...": "⏳ En attente que vous cliquiez sur le lien et démarriez le bot...",
  "✅ Your Telegram account is successfully linked!": "✅ Votre compte Telegram est correctement lié !",
  "About Telemetry": "À propos de la télémétrie",
  "Additional Permissions Required": "Permissions supplémentaires requises",
  "Are you sure you want to disable telemetry for this vehicle?": "Êtes-vous sûr de vouloir désactiver la télémétrie pour ce véhicule ?",
  "Are you sure you want to unlink your Telegram account?": "Êtes-vous sûr de vouloir dissocier votre compte Telegram ?",
  "Authenticating...": "Authentification en cours...",
  "Authentication Failed": "Échec de l'authentification",
  "Authentication failed {{error}}": "Échec de l'authentification : {{error}}",
  "Authentication successful! Checking consent status...": "Authentification réussie ! Vérification du statut de consentement...",
  "Authentication successful! Redirecting to consent form...": "Authentification réussie ! Redirection vers le formulaire de consentement...",
  "Authentication successful! Redirecting to dashboard...": "Authentification réussie ! Redirection vers le tableau de bord...",
  "Battery-Efficient Monitoring": "Surveillance Économe en Énergie",
  "Click \"Fix Permissions\" to re-authenticate with Tesla and grant the required permissions. You'll be redirected back here automatically.": "Cliquez sur \"Corriger les permissions\" pour vous ré-authentifier avec Tesla et accorder les permissions requises. Vous serez redirigé automatiquement ici.",
  "Click \"Generate Telegram Link\" to create a unique connection link that expires in 15 minutes.": "Cliquez sur \"Générer le lien Telegram\" pour créer un lien de connexion unique qui expire dans 15 minutes.",
  "Click the link to open our Telegram bot. The bot will automatically send a /start command with your unique token.": "Cliquez sur le lien pour ouvrir notre bot Telegram. Le bot enverra automatiquement une commande /start avec votre token unique.",
  "Configure →": "Configurer →",
  "Configuring...": "Configuration en cours...",
  "Confirm Connection": "Confirmer la connexion",
  "Connecting...": "Connexion en cours...",
  "Copied!": "Copié !",
  "Copy": "Copier",
  "Dashboard": "Tableau de bord",
  "Disable": "Désactiver",
  "Disable Telemetry": "Désactiver la télémétrie",
  "Disabled": "Désactivé",
  "Disabling...": "Désactivation en cours...",
  "Enable": "Activer",
  "Enable Telemetry": "Activer la télémétrie",
  "Enabled": "Activé",
  "Enabling telemetry allows SentryGuard to monitor your vehicle's Sentry Mode status in real-time. When suspicious activity is detected, you'll receive instant alerts via Telegram.": "L'activation de la télémétrie permet à SentryGuard de surveiller le statut du mode Sentinel de votre véhicule en temps réel sans épuiser votre batterie. Lorsqu'une activité suspecte est détectée, vous recevrez des alertes instantanées via Telegram.",
  "End-to-end encrypted communication with Tesla's official API. Your data stays yours.": "Communication chiffrée de bout en bout avec l'API officielle de Tesla. Vos données vous appartiennent.",
  "Failed to initiate login": "Échec de l'initialisation de la connexion",
  "Failed to configure telemetry": "Échec de la configuration de la télémétrie",
  "Virtual key not added to the vehicle": "Clé virtuelle non ajoutée au véhicule",
  "Unsupported hardware (pre-2018 Model S/X)": "Matériel non supporté (Model S/X avant 2018)",
  "Unsupported firmware version for telemetry": "Version logicielle non supportée pour la télémétrie",
  "Maximum telemetry configurations already present": "Nombre maximum de configurations de télémétrie atteint",
  "Vehicle skipped for an unknown reason": "Véhicule ignoré pour une raison inconnue",
  "Vehicle skipped for an unknown reason: {{details}}": "Véhicule ignoré pour une raison inconnue : {{details}}",
  "Fix Permissions": "Corriger les permissions",
  "Generate Link": "Générer le lien",
  "Generate Telegram Link": "Générer le lien Telegram",
  "Generating...": "Génération en cours...",
  "GitHub": "GitHub",
  "How It Works": "Comment ça fonctionne",
  "If donations no longer cover expenses, the service may shut down, become paid (at actual cost, around $0.50/user), or be limited to current users. Your support keeps it free and open!": "Si les dons ne couvrent plus les dépenses, le service pourra fermer, devenir payant (au coût réel, environ 0,50 $/utilisateur), ou être limité aux utilisateurs actuels. Votre soutien le garde gratuit et ouvert !",
  "Instant Alerts": "Alertes instantanées",
  "Instant Telegram notifications": "Notifications Telegram instantanées",
  "Link your Telegram account to receive instant vehicle alerts": "Lie votre compte Telegram pour recevoir des alertes instantanées sur le véhicule",
  "Link your Telegram account to receive vehicle alerts.": "Lie votre compte Telegram pour recevoir des alertes sur le véhicule.",
  "Linked": "Lié",
  "Linked on": "Lié le",
  "Loading...": "Chargement en cours...",
  "Login with Tesla": "Se connecter avec Tesla",
  "Logout": "Déconnexion",
  "Manage": "Gérer",
  "Manage Sentry Mode telemetry monitoring": "Gérer la surveillance télémétrique du mode Sentinel pour vos véhicules Tesla",
  "Manage Vehicles": "Gérer les véhicules",
  "Model": "Modèle",
  "Monitor and protect your Tesla vehicles": "Surveillez et protégez vos véhicules Tesla",
  "Monitor Sentry Mode via telemetry without battery drain": "Surveillez l'état du mode Sentinel de votre véhicule via la télémétrie, sans épuiser votre batterie.",
  "No vehicles": "Aucun véhicule",
  "No vehicles found": "Aucun véhicule trouvé",
  "No vehicles found in your Tesla account. They will appear here automatically once detected.": "Aucun véhicule trouvé dans votre compte Tesla. Ils apparaîtront ici automatiquement une fois détectés.",
  "Not affiliated with Tesla, Inc. Tesla and the Tesla logo are trademarks of Tesla, Inc.": "Non affilié à Tesla, Inc. Tesla et le logo Tesla sont des marques déposées de Tesla, Inc.",
  "Not linked": "Non lié",
  "Offline access": "Accès hors ligne",
  "Open in Telegram": "Ouvrir dans Telegram",
  "Open Telegram": "Ouvrir Telegram",
  "OpenID authentication": "Authentification OpenID",
  "Pair Virtual Key": "Associer la clé virtuelle",
  "Permission Update Required": "Mise à jour des permissions requise",
  "Privacy & Security": "Confidentialité et sécurité",
  "Processing authentication...": "Traitement de l'authentification...",
  "Protect Your Tesla": "Protégez votre Tesla",
  "Quick Actions": "Actions rapides",
  "Re-authenticating...": "Ré-authentification en cours...",
  "Real-time monitoring and instant alerts for your Tesla vehicle": "Surveillance en temps réel et alertes instantanées pour votre véhicule Tesla",
  "Real-time Sentry Mode monitoring": "Surveillance du mode Sentry en temps réel",
  "Receive Alerts": "Recevoir des alertes",
  "Receive real-time Telegram notifications when your vehicle's Sentry Mode is triggered.": "Recevez des notifications Telegram en temps réel lorsque le mode Sentry de votre véhicule est déclenché.",
  "Refresh": "Actualiser",
  "Refresh Vehicles": "Actualiser les véhicules",
  "Return to Home": "Retour à l'accueil",
  "Secure & Private": "Sécurisé et privé",
  "Secure end-to-end encryption": "Chiffrement de bout en bout sécurisé",
  "Secure OAuth authentication powered by Tesla": "Authentification OAuth sécurisée propulsée par Tesla",
  "Send Test Message": "Envoyer un message de test",
  "Sending...": "Envoi en cours...",
  "SentryGuard": "SentryGuard",
  "SentryGuard is a non-profit, open-source project built by the community for Tesla owners. It depends on donations to cover server and development costs.": "SentryGuard est un projet open-source à but non lucratif créé par la communauté pour les propriétaires de Tesla. Il dépend des dons pour couvrir les coûts de serveur et de développement.",
  "SentryGuard is a non-profit, open-source project developed by the community for Tesla owners.": "SentryGuard est un projet open-source à but non lucratif développé par la communauté pour les propriétaires de Tesla.",
  "SentryGuard needs additional permissions to work properly": "SentryGuard nécessite des permissions supplémentaires pour fonctionner correctement",
  "Setup": "Configuration",
  "Success!": "Succès !",
  "Support SentryGuard": "Soutenir SentryGuard",
  "Telegram": "Telegram",
  "Telegram Alerts": "Alertes Telegram",
  "Telegram Configuration": "Configuration Telegram",
  "Telemetry Enabled": "Télémétrie activée",
  "Tesla Authorization Revoked": "Autorisation Tesla révoquée",
  "Tesla security policies required re-authorization": "Les politiques de sécurité Tesla ont nécessité une ré-autorisation",
  "Telemetry monitors Sentry Mode and sends alerts without draining battery": "SentryGuard utilise la télémétrie pour surveiller l'état du mode Sentinel de votre véhicule et envoie des alertes Telegram instantanées lors de la détection d'activité suspecte. Une surveillance efficace qui n'épuise pas votre batterie.",
  "Telemetry Status": "Statut de la télémétrie",
  "Test message sent! Check your Telegram.": "Message de test envoyé ! Vérifiez votre Telegram.",
  "This link expires in {{minutes}} minutes": "Ce lien expire dans {{minutes}} minutes",
  "To continue using SentryGuard, please reconnect your Tesla account.": "Pour continuer à utiliser SentryGuard, veuillez reconnecter votre compte Tesla.",
  "Unlink": "Dissocier",
  "Unlinking...": "Dissociation en cours...",
  "User profile data": "Données de profil utilisateur",
  "Vehicle telemetry data": "Données de télémétrie du véhicule",
  "Vehicles": "Véhicules",
  "View all →": "Voir tout →",
  "VIN": "VIN",
  "Virtual Key Not Paired": "Clé virtuelle non associée",
  "Virtual Key Paired": "Clé virtuelle associée",
  "Welcome back": "Bon retour",
  "You need to pair your Tesla account with a virtual key to use SentryGuard.": "Vous devez associer votre compte Tesla avec une clé virtuelle pour utiliser SentryGuard.",
  "You're all set! You'll now receive instant Telegram notifications when your vehicle's Sentry Mode is triggered.": "C'est prêt ! Vous recevrez désormais des notifications Telegram instantanées lorsque le mode Sentry de votre véhicule est déclenché.",
  "Your account will be linked instantly. Return to this page to see the confirmation and send a test message.": "Votre compte sera lié instantanément. Revenez sur cette page pour voir la confirmation et envoyer un message de test.",
  "Your Telegram account is connected. You will receive alerts here.": "Votre compte Telegram est connecté. Vous recevrez des alertes ici.",
  "Your Telegram chat ID is securely stored and only used to send you vehicle alerts. You can unlink your account at any time, and all associated data will be removed.": "Votre ID de chat Telegram est stocké de manière sécurisée et utilisé uniquement pour vous envoyer des alertes sur le véhicule. Vous pouvez dissocier votre compte à tout moment, et toutes les données associées seront supprimées.",
  "Your Telegram Link": "Votre lien Telegram",
  "Your Tesla account is successfully paired with a virtual key.": "Votre compte Tesla est correctement associé à une clé virtuelle.",
  "Your Tesla account needs additional permissions to use SentryGuard": "Votre compte Tesla nécessite des permissions supplémentaires pour utiliser SentryGuard",
  "Your Tesla account access has been removed. This typically happens when:": "L'accès à votre compte Tesla a été supprimé. Cela se produit généralement lorsque :",
  "You removed SentryGuard from your Tesla account": "Vous avez supprimé SentryGuard de votre compte Tesla",
  "You changed your Tesla account password": "Vous avez changé votre mot de passe Tesla",
  "Your session has expired. Please log in again.": "Votre session a expiré. Veuillez vous reconnecter.",
  "Your Vehicles": "Vos véhicules",
  "Your vehicles will appear here once they are synced from your Tesla account. Visit the Vehicles page to refresh.": "Vos véhicules apparaîtront ici une fois synchronisés depuis votre compte Tesla. Visitez la page Véhicules pour actualiser.",
  "Something went wrong": "Une erreur s'est produite",
  "We encountered an unexpected error. Please try refreshing the page.": "Nous avons rencontré une erreur inattendue. Veuillez essayer de rafraîchir la page.",
  "Try Again": "Réessayer",
  "Reloading...": "Rechargement...",
  "If the problem persists, please contact support.": "Si le problème persiste, veuillez contacter le support.",
  "Tesla Fleet API Consent": "Consentement API Flotte Tesla",
  "Please read and accept the terms below to continue": "Veuillez lire et accepter les conditions ci-dessous pour continuer",
  "By signing or accepting this form, you consent to the processing of your Personal Data by SentryGuardOrg (\"Partner\") in the context of the Partner's application titled: SentryGuard (the \"App\").": "En signant ou en acceptant ce formulaire, vous consentez au traitement de vos Données Personnelles par SentryGuardOrg (« Partenaire ») dans le cadre de l'application du Partenaire intitulée SentryGuard (l'« App »).",
  "Partner is the data controller responsible for the processing of your Personal Data in the context of the App.": "Le Partenaire est le responsable du traitement chargé du traitement de vos Données Personnelles dans le contexte de l'App.",
  "By signing or accepting this form, you also acknowledge receipt of the Tesla Customer Privacy Notice available at": "En signant ou en acceptant ce formulaire, vous reconnaissez également avoir pris connaissance de l'Avis de confidentialité client Tesla disponible à l'adresse",
  "(\"Tesla Privacy Notice\") and consent to processing of Personal Data by Tesla in accordance with the Tesla Privacy Notice.": "(« Avis de confidentialité Tesla ») et consentez au traitement de vos Données Personnelles par Tesla conformément à l'Avis de confidentialité Tesla.",
  "The App allows you to benefit from advanced monitoring and notification features based on your Tesla vehicle's Sentry Mode, including the identification and logging of security events (e.g., event detection, Sentry Mode alerts).": "L'App vous permet de bénéficier de fonctionnalités avancées de surveillance et de notification basées sur le mode Sentinelle (Sentry Mode) de votre véhicule Tesla, notamment l'identification et la journalisation d'événements de sécurité (par exemple détection d'événements, alertes associées à Sentry Mode).",
  "To provide these features, Partner must process some of your Personal Data, which may include: profile information (account identifier, display name or email address, necessary to associate events with your account); minimal vehicle information necessary for the App to function, including vehicle identifier (VIN or equivalent), Sentry Mode status (activation, detected events) and metadata associated with Sentry Mode events (date/time, event type).": "Pour fournir ces fonctionnalités, le Partenaire doit traiter certaines de vos Données Personnelles, qui peuvent inclure :\n\n- des informations de profil (identifiant de compte, nom d'affichage ou adresse e‑mail, nécessaires pour associer les événements à votre compte) ;\n\n- des informations véhicule minimales nécessaires au fonctionnement de l'App, notamment l'identifiant du véhicule (VIN ou équivalent), l'état du mode Sentinelle (activation, événements détectés) et les métadonnées associées aux événements Sentry Mode (date/heure, type d'événement).",
  "Partner does not access or process other categories of data from your vehicle (e.g., remote commands, detailed driving data, battery or precise location information), beyond what is strictly necessary for the App to function as described above.": "Le Partenaire n'accède ni ne traite pas d'autres catégories de données issues de votre véhicule (par exemple commandes à distance, données de conduite détaillées, informations de batterie ou de localisation précise), en dehors de ce qui est strictement nécessaire au fonctionnement de l'App tel que décrit ci‑dessus.",
  "Partner will only use this information for: (a) providing you with monitoring and notification features related to Sentry Mode; (b) associating Sentry Mode events with your user account and vehicle; (c) improving service reliability and security (e.g., technical incident diagnostics); (d) complying with applicable legal obligations, where applicable.": "Le Partenaire utilisera ces informations uniquement pour :\n\n(a) vous fournir les fonctionnalités de surveillance et de notification liées au mode Sentinelle ;\n\n(b) associer les événements Sentry Mode à votre compte utilisateur et à votre véhicule ;\n\n(c) améliorer la fiabilité et la sécurité du service (par exemple diagnostic d'incidents techniques) ;\n\n(d) respecter les obligations légales applicables, le cas échéant.",
  "Partner maintains administrative, technical, and physical safeguards designed to protect Personal Data against accidental, unlawful or unauthorized destruction, loss, alteration, access, disclosure or use, including encryption of data in transit and, where appropriate, at rest. Partner will only retain your Personal Data for as long as necessary to provide you with the App and the features described above, unless otherwise required or authorized by applicable law or if you request early deletion.": "Le Partenaire maintient des mesures de protection administratives, techniques et physiques conçues pour protéger les Données Personnelles contre la destruction, la perte, l'altération, l'accès, la divulgation ou l'utilisation accidentelle, illégale ou non autorisée, y compris le chiffrement des données en transit et, lorsque cela est approprié, au repos. Le Partenaire ne conservera vos Données Personnelles que pendant la durée nécessaire pour vous fournir l'App et les fonctionnalités décrites ci‑dessus, sauf exigence ou autorisation différente de la loi applicable ou si vous demandez la suppression anticipée.",
  "Subject to applicable law (including GDPR), you may have the right to request access and receive information about your Personal Data, update and correct inaccuracies, and request deletion when legal conditions are met. You also have the right to withdraw your consent at any time, without cost, which may however limit or prevent use of the App. To exercise your rights, withdraw your consent or obtain more information about the App and the processing of your Personal Data, you can contact Partner at: hello@sentryguard.org": "Sous réserve de la loi applicable (notamment le RGPD), vous pouvez avoir le droit de demander l'accès et de recevoir des informations sur vos Données Personnelles, de mettre à jour et corriger les inexactitudes, et de demander leur suppression lorsque les conditions légales sont remplies. Vous avez également le droit de retirer votre consentement à tout moment, sans frais, ce qui peut toutefois limiter ou empêcher l'utilisation de l'App.\n\nPour exercer vos droits, retirer votre consentement ou obtenir plus d'informations sur l'App et le traitement de vos Données Personnelles, vous pouvez contacter le Partenaire à l'adresse suivante : hello@sentryguard.org.",
  "I consent to the collection, use, and processing of my Personal Data as described above.": "Je consens à la collecte, à l'utilisation et au traitement de mes Données Personnelles comme décrit ci‑dessus.",
  "I Accept": "J'accepte",
  "Processing...": "Traitement en cours...",
  "Consent accepted successfully!": "Consentement accepté avec succès !",
  "Accepted at: {{date}}": "Accepté le : {{date}}",
  "Redirecting to dashboard...": "Redirection vers le tableau de bord...",
  "By clicking \"I Accept\", you agree to the terms above and consent to the processing of your personal data.": "En cliquant sur \"J'accepte\", vous acceptez les conditions ci-dessus et consentez au traitement de vos données personnelles.",
  "Revoke Consent": "Révoquer le consentement",
  "Are you sure you want to revoke your consent? This will permanently delete your account and all associated data, including telemetry configurations.": "Êtes-vous sûr de vouloir révoquer votre consentement ? Cela supprimera définitivement votre compte et toutes les données associées, y compris les configurations de télémétrie.",
  "Loading consent text...": "Chargement du texte de consentement...",
  "Failed to load consent text": "Échec du chargement du texte de consentement",
  "Frequently Asked Questions": "Questions Fréquemment Posées",
  "Find answers to common questions about SentryGuard": "Trouvez des réponses aux questions courantes sur SentryGuard",
  "General Questions": "Questions Générales",
  "What is SentryGuard?": "Qu'est-ce que SentryGuard ?",
  "SentryGuard is a non-profit, open-source service that monitors your Tesla vehicle's Sentry Mode status in real-time and sends instant alerts via Telegram when suspicious activity is detected. It uses Tesla's official API and telemetry to provide efficient monitoring without draining your battery.": "SentryGuard est un service open-source à but non lucratif qui surveille le statut du mode Sentinelle de votre véhicule Tesla en temps réel et envoie des alertes instantanées via Telegram lorsque une activité suspecte est détectée. Il utilise l'API officielle de Tesla et la télémétrie pour fournir une surveillance efficace sans épuiser votre batterie.",
  "Is SentryGuard free?": "SentryGuard est-il gratuit ?",
  "Yes, SentryGuard is completely free to use. However, it depends on donations to cover server and development costs. If donations no longer cover expenses, the service may need to adapt, but we strive to keep it free and open-source for the community.": "Oui, SentryGuard est entièrement gratuit. Cependant, il dépend des dons pour couvrir les coûts de serveur et de développement. Si les dons ne couvrent plus les dépenses, le service devra peut-être s'adapter, mais nous nous efforçons de le garder gratuit et open-source pour la communauté.",
  "Is SentryGuard affiliated with Tesla?": "SentryGuard est-il affilié à Tesla ?",
  "No, SentryGuard is not affiliated with Tesla, Inc. It is an independent, community-driven project. Tesla and the Tesla logo are trademarks of Tesla, Inc.": "Non, SentryGuard n'est pas affilié à Tesla, Inc. C'est un projet indépendant, géré par la communauté. Tesla et le logo Tesla sont des marques déposées de Tesla, Inc.",
  "How does SentryGuard work?": "Comment fonctionne SentryGuard ?",
  "SentryGuard uses Tesla's official Fleet API to monitor your vehicle's Sentry Mode status via telemetry. When Sentry Mode is triggered, you receive instant notifications through Telegram. The monitoring is battery-efficient as it uses telemetry data rather than constantly polling your vehicle.": "SentryGuard utilise l'API Flotte officielle de Tesla pour surveiller le statut du mode Sentinelle de votre véhicule via la télémétrie. Lorsque le mode Sentinelle est déclenché, vous recevez des notifications instantanées via Telegram. La surveillance est économe en énergie car elle utilise les données de télémétrie plutôt que d'interroger constamment votre véhicule.",
  "Setup & Configuration": "Configuration et Installation",
  "How do I get started with SentryGuard?": "Comment commencer avec SentryGuard ?",
  "To get started, click \"Login with Tesla\" on the homepage. You'll be redirected to Tesla's official authentication page. After logging in and granting permissions, you'll need to accept the consent form, then configure Telegram alerts and enable telemetry for your vehicles.": "Pour commencer, cliquez sur \"Se connecter avec Tesla\" sur la page d'accueil. Vous serez redirigé vers la page d'authentification officielle de Tesla. Après vous être connecté et avoir accordé les permissions, vous devrez accepter le formulaire de consentement, puis configurer les alertes Telegram et activer la télémétrie pour vos véhicules.",
  "What permissions does SentryGuard need?": "Quelles permissions SentryGuard nécessite-t-il ?",
  "SentryGuard requires access to your vehicle's telemetry data to monitor Sentry Mode status. It does not access location data, battery details, or remote commands beyond what is necessary for monitoring Sentry Mode events.": "SentryGuard nécessite l'accès aux données de télémétrie de votre véhicule pour surveiller le statut du mode Sentinelle. Il n'accède pas aux données de localisation, aux détails de la batterie ou aux commandes à distance au-delà de ce qui est nécessaire pour surveiller les événements du mode Sentinelle.",
  "How do I link my Telegram account?": "Comment lier mon compte Telegram ?",
  "Go to the Telegram Configuration page in your dashboard, click \"Generate Telegram Link\", and open the link in Telegram. The bot will automatically link your account. The link expires in 15 minutes for security.": "Allez sur la page de Configuration Telegram dans votre tableau de bord, cliquez sur \"Générer le lien Telegram\", et ouvrez le lien dans Telegram. Le bot liera automatiquement votre compte. Le lien expire dans 15 minutes pour des raisons de sécurité.",
  "What if I can't enable telemetry for my vehicle?": "Que faire si je ne peux pas activer la télémétrie pour mon véhicule ?",
  "Some vehicles may not support telemetry due to hardware limitations (pre-2018 Model S/X) or firmware versions. Make sure your vehicle has a virtual key paired and is running a supported firmware version. If issues persist, check the error message for specific details.": "Certains véhicules peuvent ne pas supporter la télémétrie en raison de limitations matérielles (Model S/X d'avant 2018) ou de versions de firmware. Assurez-vous que votre véhicule a une clé virtuelle associée et exécute une version de firmware supportée. Si les problèmes persistent, vérifiez le message d'erreur pour plus de détails.",
  "Security & Privacy": "Sécurité et Confidentialité",
  "Is my data secure?": "Mes données sont-elles sécurisées ?",
  "Yes, SentryGuard uses Tesla's official API with end-to-end encryption. Your data is stored securely and only used to provide monitoring and alert services. We only access the minimal data necessary for Sentry Mode monitoring.": "Oui, SentryGuard utilise l'API officielle de Tesla avec un chiffrement de bout en bout. Vos données sont stockées de manière sécurisée et utilisées uniquement pour fournir des services de surveillance et d'alerte. Nous n'accédons qu'aux données minimales nécessaires pour la surveillance du mode Sentinelle.",
  "What data does SentryGuard collect?": "Quelles données SentryGuard collecte-t-il ?",
  "SentryGuard only collects: profile information (account identifier, display name or email), minimal vehicle information (VIN, Sentry Mode status, event metadata). We do not access location data, detailed driving data, battery information, or remote commands beyond what is necessary for Sentry Mode monitoring.": "SentryGuard ne collecte que : les informations de profil (identifiant de compte, nom d'affichage ou e-mail), les informations minimales sur le véhicule (VIN, statut du mode Sentinelle, métadonnées d'événements). Nous n'accédons pas aux données de localisation, aux données de conduite détaillées, aux informations sur la batterie ou aux commandes à distance au-delà de ce qui est nécessaire pour la surveillance du mode Sentinelle.",
  "Can I delete my data?": "Puis-je supprimer mes données ?",
  "Yes, you can unlink your Telegram account and revoke your consent at any time. This will remove all associated data. You can also contact us at hello@sentryguard.org to request data deletion.": "Oui, vous pouvez dissocier votre compte Telegram et révoquer votre consentement à tout moment. Cela supprimera toutes les données associées. Vous pouvez également nous contacter à hello@sentryguard.org pour demander la suppression des données.",
  "Where is my data stored?": "Où mes données sont-elles stockées ?",
  "Your data is stored on secure servers with encryption in transit and at rest. We maintain administrative, technical, and physical safeguards to protect your personal data.": "Vos données sont stockées sur des serveurs sécurisés avec un chiffrement en transit et au repos. Nous maintenons des mesures de protection administratives, techniques et physiques pour protéger vos données personnelles.",
  "Troubleshooting": "Dépannage",
  "I'm not receiving Telegram alerts. What should I do?": "Je ne reçois pas d'alertes Telegram. Que dois-je faire ?",
  "First, verify that your Telegram account is linked correctly. Send a test message from the Telegram Configuration page. Make sure telemetry is enabled for your vehicle and that Sentry Mode is active on your Tesla. Check that you haven't blocked the Telegram bot.": "Tout d'abord, vérifiez que votre compte Telegram est correctement lié. Envoyez un message de test depuis la page de Configuration Telegram. Assurez-vous que la télémétrie est activée pour votre véhicule et que le mode Sentinelle est actif sur votre Tesla. Vérifiez que vous n'avez pas bloqué le bot Telegram.",
  "Why did my Tesla authorization get revoked?": "Pourquoi mon autorisation Tesla a-t-elle été révoquée ?",
  "Tesla authorization can be revoked if you remove SentryGuard from your Tesla account, change your Tesla password, or if Tesla security policies require re-authorization. Simply log in again to restore access.": "L'autorisation Tesla peut être révoquée si vous supprimez SentryGuard de votre compte Tesla, changez votre mot de passe Tesla, ou si les politiques de sécurité Tesla nécessitent une ré-autorisation. Connectez-vous simplement à nouveau pour restaurer l'accès.",
  "SentryGuard shows \"Virtual Key Not Paired\". What does this mean?": "SentryGuard affiche \"Clé virtuelle non associée\". Qu'est-ce que cela signifie ?",
  "You need to pair a virtual key with your vehicle to use SentryGuard. This is done through the Tesla app. Go to Security & Drivers in your Tesla app and add SentryGuard as a key. Then return to SentryGuard and refresh your vehicles.": "Vous devez associer une clé virtuelle à votre véhicule pour utiliser SentryGuard. Cela se fait via l'application Tesla. Allez dans Sécurité et Conducteurs dans votre application Tesla et ajoutez SentryGuard comme clé. Ensuite, revenez à SentryGuard et actualisez vos véhicules.",
  "Can I use SentryGuard with multiple vehicles?": "Puis-je utiliser SentryGuard avec plusieurs véhicules ?",
  "Yes, SentryGuard supports multiple vehicles. Each vehicle can be configured independently. Go to the Vehicles page to manage telemetry for each vehicle.": "Oui, SentryGuard prend en charge plusieurs véhicules. Chaque véhicule peut être configuré indépendamment. Allez sur la page Véhicules pour gérer la télémétrie de chaque véhicule.",
  "Support & Donations": "Support et Dons",
  "How can I support SentryGuard?": "Comment puis-je soutenir SentryGuard ?",
  "You can support SentryGuard by making a donation through the Buy Me a Coffee widget on the website. Your support helps cover server costs and keeps the service free for everyone. You can also contribute to the project on GitHub.": "Vous pouvez soutenir SentryGuard en faisant un don via le widget Buy Me a Coffee sur le site web. Votre soutien aide à couvrir les coûts de serveur et maintient le service gratuit pour tous. Vous pouvez également contribuer au projet sur GitHub.",
  "How can I report a bug or request a feature?": "Comment puis-je signaler un bug ou demander une fonctionnalité ?",
  "You can report bugs or request features by opening an issue on our GitHub repository at https://github.com/abarghoud/SentryGuard. We welcome community contributions!": "Vous pouvez signaler des bugs ou demander des fonctionnalités en ouvrant une issue sur notre dépôt GitHub à https://github.com/abarghoud/SentryGuard. Nous accueillons les contributions de la communauté !",
  "Who can I contact for support?": "Qui puis-je contacter pour le support ?",
  "For support, you can contact us at hello@sentryguard.org or open an issue on GitHub. We do our best to respond to all inquiries.": "Pour le support, vous pouvez nous contacter à hello@sentryguard.org ou ouvrir une issue sur GitHub. Nous faisons de notre mieux pour répondre à toutes les demandes.",
  "Still have questions?": "Vous avez encore des questions ?",
  "Can't find the answer you're looking for? Please feel free to contact us.": "Vous ne trouvez pas la réponse que vous cherchez ? N'hésitez pas à nous contacter.",
  "Contact Support": "Contacter le Support",
  "FAQ": "FAQ",
  "Does Sentry Mode need to be activated to receive notifications?": "Le mode Sentinelle doit-il être activé pour recevoir les notifications ?",
  "Why Telegram?": "Pourquoi Telegram ?",
  "Why isn't there a mobile app?": "Pourquoi n'y a-t-il pas d'application mobile ?",
  "Does SentryGuard impact the vehicle's battery or range?": "SentryGuard a-t-il un impact sur la batterie ou l'autonomie du véhicule ?",
  "What is SentryGuard description": "SentryGuard est un service open-source à but non lucratif qui surveille le statut du mode Sentinelle de votre véhicule Tesla en temps réel et envoie des alertes instantanées via Telegram lorsque une activité suspecte est détectée. Il utilise l'API officielle de Tesla et la télémétrie pour fournir une surveillance efficace sans épuiser votre batterie.",
  "SentryGuard requires active Sentry Mode": "Oui, le mode Sentinelle doit être actif sur votre véhicule Tesla pour que SentryGuard puisse détecter et envoyer des alertes. Le service surveille quand le mode Sentinelle est déclenché, mais il ne peut pas fonctionner si le mode Sentinelle est désactivé dans les paramètres de votre véhicule.",
  "Why we chose Telegram": "Telegram a été choisi parce que c'est une plateforme de messagerie rapide, fiable et sécurisée qui fonctionne partout dans le monde. Elle fournit des notifications instantanées sans nécessiter l'installation d'applications supplémentaires, et elle a une excellente efficacité énergétique. Contrairement aux SMS ou autres services de messagerie, Telegram est gratuit, chiffré, et fonctionne de manière fiable dans tous les pays.",
  "Why no mobile app": "SentryGuard est développé par une petite équipe communautaire avec des ressources limitées et aucun budget. Créer et maintenir une application mobile nécessiterait un temps de développement supplémentaire significatif, des soumissions aux app stores, et une maintenance continue sur iOS et Android. Puisque Telegram fournit déjà d'excellentes notifications mobiles, nous avons concentré nos ressources limitées sur les fonctionnalités principales. L'interface web est responsive et fonctionne bien sur les appareils mobiles.",
  "Is SentryGuard free description": "Oui, SentryGuard est entièrement gratuit. Cependant, il dépend des dons pour couvrir les coûts de serveur et de développement. Si les dons ne couvrent plus les dépenses, le service devra peut-être s'adapter, mais nous nous efforçons de le garder gratuit et open-source pour la communauté.",
  "Is SentryGuard affiliated with Tesla description": "Non, SentryGuard n'est pas affilié à Tesla, Inc. C'est un projet indépendant, géré par la communauté. Tesla et le logo Tesla sont des marques déposées de Tesla, Inc.",
  "How does SentryGuard work description": "SentryGuard utilise l'API Flotte officielle de Tesla pour surveiller le statut du mode Sentinelle de votre véhicule via la télémétrie. Lorsque le mode Sentinelle est déclenché, vous recevez des notifications instantanées via Telegram. La surveillance est économe en énergie car elle utilise les données de télémétrie plutôt que d'interroger constamment votre véhicule.",
  "How to get started with SentryGuard": "Pour commencer, cliquez sur \"Se connecter avec Tesla\" sur la page d'accueil. Vous serez redirigé vers la page d'authentification officielle de Tesla. Après vous être connecté et avoir accordé les permissions, vous devrez accepter le formulaire de consentement. Ensuite, dans la <0>page Véhicules</0>, associez une clé virtuelle à votre véhicule (cela vous redirigera vers le site web de Tesla pour approuver via l'application Tesla), <1>configurez les alertes Telegram</1> et activez la télémétrie pour vos véhicules.",
  "What permissions SentryGuard needs": "SentryGuard nécessite l'accès aux données de télémétrie de votre véhicule pour surveiller le statut du mode Sentinelle. Il n'accède pas aux données de localisation, aux détails de la batterie ou aux commandes à distance au-delà de ce qui est nécessaire pour surveiller les événements du mode Sentinelle.",
  "How to link Telegram account": "Allez sur la <0>page de Configuration Telegram</0> dans votre tableau de bord, cliquez sur \"Générer le lien Telegram\", et ouvrez le lien dans Telegram. Le bot liera automatiquement votre compte. Le lien expire dans 15 minutes pour des raisons de sécurité.",
  "Cannot enable telemetry help": "Certains véhicules peuvent ne pas supporter la télémétrie en raison de limitations matérielles (Model S/X d'avant 2018) ou de versions de firmware. Assurez-vous que votre véhicule a une clé virtuelle associée et exécute une version de firmware supportée. Si les problèmes persistent, vérifiez le message d'erreur pour plus de détails.",
  "Is my data secure answer": "Oui, SentryGuard utilise l'API officielle de Tesla avec un chiffrement de bout en bout. Vos données sont stockées de manière sécurisée et utilisées uniquement pour fournir des services de surveillance et d'alerte. Nous n'accédons qu'aux données minimales nécessaires pour la surveillance du mode Sentinelle.",
  "What data SentryGuard collects": "SentryGuard ne collecte que : les informations de profil (identifiant de compte, nom d'affichage ou e-mail), les informations minimales sur le véhicule (VIN, statut du mode Sentinelle, métadonnées d'événements). Nous n'accédons pas aux données de localisation, aux données de conduite détaillées, aux informations sur la batterie ou aux commandes à distance au-delà de ce qui est nécessaire pour la surveillance du mode Sentinelle.",
  "Can I delete my data answer": "Oui, vous pouvez dissocier votre compte Telegram et révoquer votre consentement à tout moment. Cela supprimera toutes les données associées. La fonctionnalité de suppression des données est actuellement en développement. Pour le moment, veuillez nous contacter à <0>hello@sentryguard.org</0> pour demander la suppression des données.",
  "Where is my data stored answer": "Vos données sont stockées sur des serveurs sécurisés situés en Europe, avec un chiffrement en transit et au repos. Nous maintenons des mesures de protection administratives, techniques et physiques pour protéger vos données personnelles.",
  "Not receiving alerts help": "Tout d'abord, vérifiez que votre compte Telegram est correctement lié. Envoyez un message de test depuis la <0>page de Configuration Telegram</0>. Assurez-vous que la télémétrie est activée pour votre véhicule et que le mode Sentinelle est actif sur votre Tesla. Vérifiez aussi la <1>configuration du véhicule</1> pour activer la télémétrie et configurer la clé virtuelle. Enfin, vérifiez que vous n'avez pas bloqué le bot Telegram.",
  "SentryGuard battery impact": "Non, SentryGuard n'a aucun impact sur la batterie ou l'autonomie de votre véhicule. Le service utilise le système de télémétrie de Tesla, qui est conçu pour être extrêmement efficace. Contrairement aux applications tierces qui pourraient interroger votre véhicule constamment, SentryGuard ne reçoit des données que lorsqu'il se produit des événements, utilisant une bande passante minimale et aucune puissance de batterie supplémentaire de votre véhicule.",
  "Tesla authorization revoked help": "L'autorisation Tesla peut être révoquée si vous supprimez SentryGuard de votre compte Tesla, changez votre mot de passe Tesla, ou si les politiques de sécurité Tesla nécessitent une ré-autorisation. Connectez-vous simplement à nouveau pour restaurer l'accès.",
  "Virtual key not paired help": "Vous devez associer une clé virtuelle à votre véhicule pour utiliser SentryGuard. Dans la <0>page Véhicules</0>, cliquez sur le bouton \"Associer la clé virtuelle\" qui vous redirigera vers le site web de Tesla. Cela ouvrira votre application Tesla où vous pourrez approuver la demande de clé virtuelle. Une fois approuvée, revenez à SentryGuard et actualisez vos véhicules.",
  "Multiple vehicles support": "Oui, SentryGuard prend en charge plusieurs véhicules. Chaque véhicule peut être configuré indépendamment. Allez sur la page Véhicules pour gérer la télémétrie de chaque véhicule.",
  "How to support SentryGuard": "Vous pouvez soutenir SentryGuard en faisant un don via le widget Buy Me a Coffee sur le site web, ou directement sur <1>https://buymeacoffee.com/sentryguardorg</1>. Votre soutien aide à couvrir les coûts de serveur et maintient le service gratuit pour tous. Vous pouvez également contribuer au projet sur <0>GitHub</0> en mettant une étoile au dépôt, en signalant des problèmes ou en soumettant des pull requests.",
  "How to report bugs or request features": "Vous pouvez signaler des bugs ou demander des fonctionnalités en ouvrant une issue sur notre <0>dépôt GitHub</0>, ou en nous contactant via le chat de support sur le site web. Nous accueillons les contributions de la communauté !",
  "Who to contact for support": "Pour le support, vous pouvez nous contacter à <0>hello@sentryguard.org</0>, ouvrir une issue sur <1>GitHub</1>, ou utiliser le chat de support sur le site web. Nous faisons de notre mieux pour répondre à toutes les demandes.",
  "Does SentryGuard provide video footage?": "SentryGuard fournit-il des vidéos ?",
  "SentryGuard video access explanation": "SentryGuard n'a pas accès aux flux vidéo des caméras de votre véhicule. Cependant, lorsque vous recevez une alerte du mode Sentinelle via Telegram, vous pouvez cliquer sur le bouton \"Vérifier\" dans le message pour ouvrir directement l'application Tesla et consulter le flux de caméra en direct afin de vérifier ce qui a déclenché l'alerte.",
  "Do I need Tesla Premium Connectivity to use SentryGuard?": "Ai-je besoin de la connexion premium Tesla pour utiliser SentryGuard ?",
  "Tesla Premium Connectivity requirement": "Non, vous n'avez pas besoin de la connexion premium Tesla pour utiliser SentryGuard. Le service fonctionne avec la connectivité standard de Tesla et utilise l'API Flotte pour les données de télémétrie. Cependant, la connectivité premium peut être requise pour certaines fonctionnalités avancées de Tesla, mais SentryGuard lui-même fonctionne avec la connectivité de base du véhicule.",
  "Why doesn't Sentry Mode trigger when I test it myself?": "Pourquoi le mode Sentinelle ne se déclenche-t-il pas quand je le teste moi-même ?",
  "Sentry Mode testing explanation": "Lorsque vous testez le mode Sentinelle vous-même avec votre téléphone à proximité, Tesla détecte votre clé digitale et ne déclenche pas le mode Sentinelle car elle reconnaît un utilisateur autorisé. Le mode Sentinelle ne s'active que lorsque le véhicule détecte une activité potentiellement non autorisée. Pour tester correctement, utilisez soit le téléphone de quelqu'un d'autre pour déclencher une détection de mouvement/caméra, soit testez à distance sans que votre téléphone soit présent.",
  "Why is SentryGuard faster than Tesla notifications?": "Pourquoi SentryGuard est-il plus rapide que les notifications Tesla ?",
  "SentryGuard speed advantage explanation": "SentryGuard fournit des notifications instantanées dès que Tesla détecte un événement et commence l'enregistrement, vous donnant une prise de conscience immédiate des incidents de sécurité potentiels. En revanche, l'application Tesla elle-même n'affiche la vidéo enregistrée qu'après la fin de l'enregistrement, et même les notifications directes de Tesla arrivent plusieurs secondes plus tard. Cet avantage de rapidité peut être crucial pour réagir rapidement aux menaces de sécurité.",
  "Settings": "Paramètres",
  "Manage your account settings and preferences": "Gérer les paramètres et préférences de votre compte",
  "Account Information": "Informations du compte",
  "Name": "Nom",
  "Email": "Email",
  "Danger Zone": "Zone de danger",
  "Delete Account": "Supprimer mon compte",
  "Delete account description": "La suppression de votre compte est permanente et irréversible. Toutes vos données, y compris les configurations de télémétrie, les alertes Telegram et les informations du véhicule seront définitivement supprimées.",
  "Delete account confirmation": "Êtes-vous sûr de vouloir supprimer votre compte ? Cette action est permanente et supprimera toutes vos données, y compris les configurations de télémétrie et les alertes Telegram. Cette action ne peut pas être annulée.",
  "Back to Dashboard": "Retour au tableau de bord",
  "You're on the Waitlist!": "Vous êtes sur la liste d'attente !",
  "Thank you for your interest in SentryGuard": "Merci pour votre intérêt pour SentryGuard",
  "We have received your registration for": "Nous avons reçu votre inscription pour",
  "Your account is pending approval. We'll send you an email once your account has been approved and you can start using SentryGuard.": "Votre compte est en attente d'approbation. Nous vous enverrons un email une fois votre compte approuvé et vous pourrez commencer à utiliser SentryGuard.",
  "Approval is typically processed within 24-48 hours.": "L'approbation est généralement traitée sous 24-48 heures.",
  "Back to home": "Retour à l'accueil"
}
